nc: 1
scales:
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Input, [9]]                                   # 0
  - [-1, 1, Fliter, [3]]                                  # 1
  - [-2, 1, PatchReg, [64, 4, False]]                     # 2
  - [-1, 1, Conv, [64, 1, 1]]                             # 3
  - [-1, 4, PoolBlock, [3, True]]                         # 4  
  - [-1, 1, PatchMerging, [128, 'conv3_2']]               # 5
  - [-1, 4, PoolBlock, [3, True]]                         # 6
  - [-1, 1, PatchMerging, [320, 'conv3_2']]               # 7
  - [-1, 12, PoolBlock, [3, True]]                        # 8
  - [-1, 1, PatchMerging, [512, 'conv3_2']]               # 9
  - [-1, 4, PoolBlock, [3, True]]                         # 10
  - [-1, 1, Conv, [512, 1, 1]]                            # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]            # 12
  - [[-1, 8], 1, Concat, [1]]                           # 13
  - [-1, 3, C2f, [512]]                                   # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [[-1, 1], 3, Calibration, [3]] #

  - [-2, 1, Conv, [256, 3, 2]] 
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [[-1, 1], 3, Calibration, [3]] #

  - [-2, 1, Conv, [512, 3, 2]] 
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]

  - [[-1, 1], 3, Calibration, [3]] #

  - [[17, 21, 25], 1, Detect, [nc]]